tests/performance/results/TASK-007/03-baseline-warm.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/workload.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.0s/2m0s

running (0m02.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m02.0s/2m0s

running (0m03.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m03.0s/2m0s

running (0m04.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m04.0s/2m0s

running (0m05.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m05.0s/2m0s

running (0m06.0s), 10/10 VUs, 185 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m06.0s/2m0s

running (0m07.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m07.0s/2m0s

running (0m08.0s), 10/10 VUs, 249 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m08.0s/2m0s

running (0m09.0s), 10/10 VUs, 283 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m09.0s/2m0s

running (0m10.0s), 10/10 VUs, 318 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m10.0s/2m0s

running (0m11.0s), 10/10 VUs, 349 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m11.0s/2m0s

running (0m12.0s), 10/10 VUs, 384 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m12.0s/2m0s

running (0m13.0s), 10/10 VUs, 414 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m13.0s/2m0s

running (0m14.0s), 10/10 VUs, 443 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m14.0s/2m0s

running (0m15.0s), 10/10 VUs, 475 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m15.0s/2m0s

running (0m16.0s), 10/10 VUs, 509 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m16.0s/2m0s

running (0m17.0s), 10/10 VUs, 542 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m17.0s/2m0s

running (0m18.0s), 10/10 VUs, 575 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m18.0s/2m0s

running (0m19.0s), 10/10 VUs, 606 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m19.0s/2m0s

running (0m20.0s), 10/10 VUs, 638 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m20.0s/2m0s

running (0m21.0s), 10/10 VUs, 672 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m21.0s/2m0s

running (0m22.0s), 10/10 VUs, 701 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m22.0s/2m0s

running (0m23.0s), 10/10 VUs, 735 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m23.0s/2m0s

running (0m24.0s), 10/10 VUs, 767 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m24.0s/2m0s

running (0m25.0s), 10/10 VUs, 794 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m25.0s/2m0s

running (0m26.0s), 10/10 VUs, 825 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m26.0s/2m0s

running (0m27.0s), 10/10 VUs, 858 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m27.0s/2m0s

running (0m28.0s), 10/10 VUs, 889 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m28.0s/2m0s

running (0m29.0s), 10/10 VUs, 922 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m29.0s/2m0s

running (0m30.0s), 10/10 VUs, 952 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m30.0s/2m0s

running (0m31.0s), 10/10 VUs, 985 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m31.0s/2m0s

running (0m32.0s), 10/10 VUs, 1010 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m32.0s/2m0s

running (0m33.0s), 10/10 VUs, 1043 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m33.0s/2m0s

running (0m34.0s), 10/10 VUs, 1073 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m34.0s/2m0s

running (0m35.0s), 10/10 VUs, 1106 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m35.0s/2m0s

running (0m36.0s), 10/10 VUs, 1138 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m36.0s/2m0s

running (0m37.0s), 10/10 VUs, 1170 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m37.0s/2m0s

running (0m38.0s), 10/10 VUs, 1200 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m38.0s/2m0s

running (0m39.0s), 10/10 VUs, 1234 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m39.0s/2m0s

running (0m40.0s), 10/10 VUs, 1266 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m40.0s/2m0s

running (0m41.0s), 10/10 VUs, 1299 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m41.0s/2m0s

running (0m42.0s), 10/10 VUs, 1330 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m42.0s/2m0s

running (0m43.0s), 10/10 VUs, 1359 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m43.0s/2m0s

running (0m44.0s), 10/10 VUs, 1388 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m44.0s/2m0s

running (0m45.0s), 10/10 VUs, 1425 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m45.0s/2m0s

running (0m46.0s), 10/10 VUs, 1456 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m46.0s/2m0s

running (0m47.0s), 10/10 VUs, 1487 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m47.0s/2m0s

running (0m48.0s), 10/10 VUs, 1518 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m48.0s/2m0s

running (0m49.0s), 10/10 VUs, 1546 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m49.0s/2m0s

running (0m50.0s), 10/10 VUs, 1579 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m50.0s/2m0s

running (0m51.0s), 10/10 VUs, 1613 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m51.0s/2m0s

running (0m52.0s), 10/10 VUs, 1647 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m52.0s/2m0s

running (0m53.0s), 10/10 VUs, 1677 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m53.0s/2m0s

running (0m54.0s), 10/10 VUs, 1711 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m54.0s/2m0s

running (0m55.0s), 10/10 VUs, 1744 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m55.0s/2m0s

running (0m56.0s), 10/10 VUs, 1769 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m56.0s/2m0s

running (0m57.0s), 10/10 VUs, 1800 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m57.0s/2m0s

running (0m58.0s), 10/10 VUs, 1832 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m58.0s/2m0s

running (0m59.0s), 10/10 VUs, 1862 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m59.0s/2m0s

running (1m00.0s), 10/10 VUs, 1896 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m00.0s/2m0s

running (1m01.0s), 10/10 VUs, 1927 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m01.0s/2m0s

running (1m02.0s), 10/10 VUs, 1958 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m02.0s/2m0s

running (1m03.0s), 10/10 VUs, 1992 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m03.0s/2m0s

running (1m04.0s), 10/10 VUs, 2025 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m04.0s/2m0s

running (1m05.0s), 10/10 VUs, 2054 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m05.0s/2m0s

running (1m06.0s), 10/10 VUs, 2089 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m06.0s/2m0s

running (1m07.0s), 10/10 VUs, 2120 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m07.0s/2m0s

running (1m08.0s), 10/10 VUs, 2151 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m08.0s/2m0s

running (1m09.0s), 10/10 VUs, 2183 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m09.0s/2m0s

running (1m10.0s), 10/10 VUs, 2216 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m10.0s/2m0s

running (1m11.0s), 10/10 VUs, 2244 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m11.0s/2m0s

running (1m12.0s), 10/10 VUs, 2275 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m12.0s/2m0s

running (1m13.0s), 10/10 VUs, 2306 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m13.0s/2m0s

running (1m14.0s), 10/10 VUs, 2337 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m14.0s/2m0s

running (1m15.0s), 10/10 VUs, 2369 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m15.0s/2m0s

running (1m16.0s), 10/10 VUs, 2403 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m16.0s/2m0s

running (1m17.0s), 10/10 VUs, 2432 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m17.0s/2m0s

running (1m18.0s), 10/10 VUs, 2463 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m18.0s/2m0s

running (1m19.0s), 10/10 VUs, 2497 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m19.0s/2m0s

running (1m20.0s), 10/10 VUs, 2527 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m20.0s/2m0s

running (1m21.0s), 10/10 VUs, 2558 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m21.0s/2m0s

running (1m22.0s), 10/10 VUs, 2589 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  1m22.0s/2m0s

running (1m23.0s), 10/10 VUs, 2621 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  1m23.0s/2m0s

running (1m24.0s), 10/10 VUs, 2653 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  1m24.0s/2m0s

running (1m25.0s), 10/10 VUs, 2684 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  1m25.0s/2m0s

running (1m26.0s), 10/10 VUs, 2716 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m26.0s/2m0s

running (1m27.0s), 10/10 VUs, 2748 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m27.0s/2m0s

running (1m28.0s), 10/10 VUs, 2777 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  1m28.0s/2m0s

running (1m29.0s), 10/10 VUs, 2814 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  1m29.0s/2m0s

running (1m30.0s), 10/10 VUs, 2843 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  1m30.0s/2m0s

running (1m31.0s), 10/10 VUs, 2878 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  1m31.0s/2m0s

running (1m32.0s), 10/10 VUs, 2906 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m32.0s/2m0s

running (1m33.0s), 10/10 VUs, 2941 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m33.0s/2m0s

running (1m34.0s), 10/10 VUs, 2975 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  1m34.0s/2m0s

running (1m35.0s), 10/10 VUs, 3004 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  1m35.0s/2m0s

running (1m36.0s), 10/10 VUs, 3033 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  1m36.0s/2m0s

running (1m37.0s), 10/10 VUs, 3069 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  1m37.0s/2m0s

running (1m38.0s), 10/10 VUs, 3100 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m38.0s/2m0s

running (1m39.0s), 10/10 VUs, 3135 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m39.0s/2m0s

running (1m40.0s), 10/10 VUs, 3162 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  1m40.0s/2m0s

running (1m41.0s), 10/10 VUs, 3196 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  1m41.0s/2m0s

running (1m42.0s), 10/10 VUs, 3230 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  1m42.0s/2m0s

running (1m43.0s), 10/10 VUs, 3263 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  1m43.0s/2m0s

running (1m44.0s), 10/10 VUs, 3293 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m44.0s/2m0s

running (1m45.0s), 10/10 VUs, 3325 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m45.0s/2m0s

running (1m46.0s), 10/10 VUs, 3357 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  1m46.0s/2m0s

running (1m47.0s), 10/10 VUs, 3386 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  1m47.0s/2m0s

running (1m48.0s), 10/10 VUs, 3417 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  1m48.0s/2m0s

running (1m49.0s), 10/10 VUs, 3450 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  1m49.0s/2m0s

running (1m50.0s), 10/10 VUs, 3482 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m50.0s/2m0s

running (1m51.0s), 10/10 VUs, 3515 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m51.0s/2m0s

running (1m52.0s), 10/10 VUs, 3546 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  1m52.0s/2m0s

running (1m53.0s), 10/10 VUs, 3582 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  1m53.0s/2m0s

running (1m54.0s), 10/10 VUs, 3613 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  1m54.0s/2m0s

running (1m55.0s), 10/10 VUs, 3646 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  1m55.0s/2m0s

running (1m56.0s), 10/10 VUs, 3679 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m56.0s/2m0s

running (1m57.0s), 10/10 VUs, 3709 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m57.0s/2m0s

running (1m58.0s), 10/10 VUs, 3741 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  1m58.0s/2m0s

running (1m59.0s), 10/10 VUs, 3768 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  1m59.0s/2m0s

running (2m00.0s), 10/10 VUs, 3802 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=11.41ms
    ✓ 'p(99)<1000' p(99)=14.87ms

    unexpected_errors
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11972   99.422665/s
    checks_succeeded...: 100.00% 11972 out of 11972
    checks_failed......: 0.00%   0 out of 11972

    ✓ detail: correct id
    ✓ detail: seeded version
    ✓ employee list: first page
    ✓ employee list: exactly own 120
    ✓ employee list: only own rows
    ✓ approver list: status filter holds
    ✓ approver list: department filter holds
    ✓ approver list: keyword filter holds
    ✓ approver list: page metadata consistent
    ✓ workflow: created DRAFT v0
    ✓ workflow: edited v1
    ✓ workflow: submitted PENDING v2
    ✓ workflow: decided v3
    ✓ workflow: stale approve is 409 version conflict
    ✓ workflow: detail shows final state

    CUSTOM
    expected_conflicts.............: 75     0.622845/s
    unexpected_errors..............: 0.00%  0 out of 6816

    HTTP
    http_req_duration..............: avg=7.08ms   min=2.77ms   med=6.92ms   p(90)=10.29ms  p(95)=11.41ms  p(99)=14.87ms  max=201.04ms
      { expected_response:true }...: avg=7.07ms   min=2.77ms   med=6.96ms   p(90)=10.31ms  p(95)=11.42ms  p(99)=14.83ms  max=201.04ms
    http_req_failed................: 1.10%  75 out of 6817
    http_reqs......................: 6817   56.612455/s

    EXECUTION
    iteration_duration.............: avg=315.17ms min=105.63ms med=314.21ms p(90)=474.24ms p(95)=493.31ms p(99)=526.88ms max=904.88ms
    iterations.....................: 3813   31.665438/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 9.6 MB 79 kB/s
    data_sent......................: 1.8 MB 15 kB/s



running (2m00.4s), 00/10 VUs, 3813 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s